probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
    /* Mode button hold tracking (for SEQ_MODE_BOTH) */
    bool drums_btn_held;
    bool keys_btn_held;

    /* Drum fill state (intro / outro) */
    int  fill_steps_remaining; /* > 0 while a fill is playing */
    bool fill_is_outro;        /* true = outro: stop after fill */
    bool fill_outro_done;      /* set by timer; cleared by main-task stop */
    bool fill_outro_pending;   /* wait for next bar boundary, then arm outro */
    bool started_with_fill;    /* this run was started via long-press intro */

    /* Tight voicing (Circle mode) */
    bool    tight_voicing;           /* true = close-position (default) */
    uint8_t tight_prev_notes[12];    /* MIDI notes of last voiced chord */
    int     tight_prev_count;        /* count of notes in tight_prev_notes */

    /* Thread safety */
    portMUX_TYPE mux;
} seq_state_t;

static seq_state_t s_seq;

/* Live "hold while pressed" state for the lower half of Circle mode (rows 5-8).
 * We track the exact MIDI notes that were turned on so release sends precise note-offs. */
static struct {
    uint8_t notes[12];
    int     note_count;
} s_circle_lower_hold = {};

/* Range-fill gesture: when a second step pad is pressed while the first is still held,
 * all steps between them are set to the same state as the first toggle determined. */
static struct {
    bool active;
    int  first_step;  /* linear step index (drum/chord-seq) or col-1 (melodic) */
    int  first_row;   /* row of first pad (-1 = row-agnostic); used in melodic for pitch */
    bool fill_on;     /* true = filling steps ON; false = turning them OFF */
} s_range_fill = {};

/* Per-raw-note remap table for external MIDI in FIELD mode.
 * Stores the quantized note that was actually started for each incoming note,
 * so note-offs are always sent to the correct playing voice even if the
 * harmonic state changes between press and release. */
static uint8_t s_field_note_map[128] = {};

/* Returns true if `note` is currently pressed by the user (Launchpad FIELD pad
 * or external MIDI keyboard).  Any MIDI note-off guarded by this check will
 * be skipped so that automatic chord transitions never cut a user-held note.
 * In non-FIELD mode the remap table stores raw→raw for keyboard notes, so
 * keyboard notes remain visible regardless of the current sequencer mode. */
static bool is_user_held(uint8_t note)
{
    /* Launchpad FIELD pad notes */
    for (int i = 0; i < 64; i++) {
        if (s_seq.field_notes[i].active && s_seq.field_notes[i].note == note)
            return true;
    }
    /* External MIDI keyboard notes (values in the remap table) */
    for (int i = 0; i < 128; i++) {
        if (s_field_note_map[i] != 0 && s_field_note_map[i] == note)
            return true;
    }
    return false;
}

/* ================================================
 * Timer helpers
 * ================================================ */

static uint64_t step_period_us(uint16_t bpm)
{
    /* 16th note period = 60,000,000 / (bpm * 4) microseconds */
    return 60000000ULL / ((uint64_t)bpm * 4);
}

/* ================================================
 * MIDI routing: drums → TSF when loaded, else Dexed
 * ================================================ */

/* Channel marker: active_notes[].channel == 9 means the note was sent to TSF. */
#define SEQ_CH_TSF  9
#define SEQ_CH_DEX  0

static inline void seq_drum_note_on(uint8_t note, uint8_t vel)
{
    if (tsf_engine_is_loaded()) {
        tsf_engine_handle_midi(0x99, note, vel);  /* channel 9 */
    } else {
        dexed_raw_handle_midi(0x90, note, vel);
    }
}

static inline void seq_drum_note_off(uint8_t note)
{
    if (tsf_engine_is_loaded()) {
        tsf_engine_handle_midi(0x89, note, 0);
    } else {
        dexed_raw_handle_midi(0x80, note, 0);
    }
}

/* Send Note Off to the correct engine based on stored channel marker. */
static inline void seq_note_off_routed(uint8_t channel, uint8_t note)
{
    if (channel == SEQ_CH_TSF) {
        tsf_engine_handle_midi(0x89, note, 0);
    } else {
        dexed_raw_handle_midi((uint8_t)(0x80 | channel), note, 0);
    }
}

/* ================================================
 * Timer callback -- called from esp_timer task (Core 0)
 * ================================================ */

/* Long-press tracking for SESSION button (main-task read only outside ISR) */
static volatile int64_t s_session_press_us = 0;
#define SESSION_LONG_PRESS_US  500000LL   /* 500 ms */

/* ---- Drum fill patterns (16 steps each) ----
 * Each row: drum-track index, intro velocities, outro velocities.
 * Intro: builds up into the groove (crash on beat 1, kick on quarters, snare
 *        roll at end).  Outro: snare roll building to crash on final step. */
#define FILL_PATTERN_LEN 16
struct fill_entry { int idx; uint8_t in_v[16]; uint8_t out_v[16]; };
static const fill_entry s_fill_patterns[] = {
    { 0,  /* kick */
      {100,0,0,0,100,0,0,0,100,0,0,0,100,0,0,  0},
      {100,0,0,0,  0,0,0,0,100,0,0,0,  0,0,0,  0} },
    { 2,  /* snare */
      {  0,0,0,0, 80,0,0,0,  0,0,0,0, 90,90,100,100},
      {  0,0,80,70,80,70,80,70,  0,70,80,90,100,100,100,  0} },
    { 6,  /* closed hi-hat */
      { 60,60,60,60, 60,60,60,60, 80,80,80,80,  0, 0, 0,  0},
      { 70,70,70,70, 70,70,70,70, 80,80,80,90,  0, 0, 0,  0} },
    { 13, /* crash cymbal (GM note 49) */
      { 90, 0, 0, 0,  0, 0, 0, 0,  0, 0, 0, 0,  0, 0, 0,  0},
      {  0, 0, 0, 0,  0, 0, 0, 0,  0, 0, 0, 0,  0, 0, 0,100} },
};
#define FILL_NUM_TRACKS 4

/* ---------------------------------------------------------------------------
 * voice_tight_notes — close-position chord voicing
 *
 * Given a chord mask (bits 0-11 = semitones above root) and the absolute
 * root pitch class, positions each note as close as possible to the centroid
 * of the previous chord (default A3=57 when no prev).  Output notes are in
 * MIDI range 24-108.
 * -------------------------------------------------------------------------*/
static void voice_tight_notes(uint16_t mask, uint8_t abs_root,
                               const uint8_t *prev, int prev_cnt,
                               uint8_t *out, int *out_cnt)
{
    uint8_t classes[12]; int n = 0;
    for (int i = 0; i < 12; i++)
        if ((mask >> i) & 1) classes[n++] = (uint8_t)((abs_root + i) % 12);
    int center = 69;  /* A4 default — one octave above previous A3 centre */
    if (prev_cnt > 0) {
        int sum = 0;
        for (int i = 0; i < prev_cnt; i++) sum += prev[i];
        center = sum / prev_cnt;
    }
    int cnt = 0;
    for (int i = 0; i < n; i++) {
        int pc = (int)classes[i];
        int note = pc + ((center - pc + 6) / 12) * 12;
        while (note < 36)  note += 12;
        while (note > 120) note -= 12;
        out[cnt++] = (uint8_t)note;
    }
    *out_cnt = cnt;
}

static void seq_timer_callback(void *arg)
{
    seq_state_t *s = (seq_state_t *)arg;

    portENTER_CRITICAL(&s->mux);

    /* Guard: outro fill has finished — wait for main task to call stop */
    if (s->fill_outro_done) {
        portEXIT_CRITICAL(&s->mux);
        return;
    }

    /* 1. Note Off for all currently sounding step notes (NOT bar chord notes) */
    for (int i = 0; i < s->active_note_count; i++) {
        seq_note_off_routed(s->active_notes[i].channel, s->active_notes[i].note);
    }
    s->active_note_count = 0;

    /* 2. Advance playhead */
    s->current_step = (s->current_step + 1) % s->num_steps;
    int step = s->current_step;

    /* Arm pending outro at the start of the next bar */
    if (s->fill_outro_pending && step == 0 && s->fill_steps_remaining == 0) {
        s->fill_outro_pending   = false;
        s->fill_is_outro        = true;
        s->fill_outro_done      = false;
        s->fill_steps_remaining = s->num_steps;
        /* Silence all sounding notes immediately so only the fill plays */
        for (int i = 0; i < s->bar_chord_note_count; i++) {
            if (s->bar_chord_notes[i].active) {
                dexed_raw_handle_midi(0x80, s->bar_chord_notes[i].note, 0);
                s->bar_chord_notes[i].active = false;
            }
        }
        s->bar_chord_note_count = 0;
        for (int i = 0; i < s->active_note_count; i++)
            seq_note_off_routed(s->active_notes[i].channel, s->active_notes[i].note);
        s->active_note_count = 0;
    }

    /* 3. At each quarter-note boundary (every 4 steps): advance chord sequencer or bar chord.
     * Skipped during outro fill so no new notes are triggered. */
    if (step % 4 == 0 && s->playing && !s->fill_is_outro) {
        /* Advance chord-seq playhead independently (0-31 over 4 drum loops) */
        s->chord_seq_step = (s->chord_seq_step < 0) ? 0 : (s->chord_seq_step + 1) % 32;
        int q = s->chord_seq_step;

        /* Check whether the chord step sequencer has any programmed steps */
        bool chord_seq_has_steps = false;
        for (int i = 0; i < 32; i++) {
            if (s->chord_seq_steps[i].active) { chord_seq_has_steps = true; break; }
        }

