probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
        uint8_t play_root = 0xFF;   /* 0xFF = no chord this quarter */
        chord_type_t play_type = CHORD_MAJ;

        if (chord_seq_has_steps) {
            if (s->chord_seq_steps[q].active) {
                play_root = s->chord_seq_steps[q].chord_root;
                play_type = s->chord_seq_steps[q].chord_type;
            }
        } else if (step == 0 && s->held_chord.active) {
            /* Legacy: held chord fires once per 2-bar loop (only when no chord seq programmed) */
            play_root = s->held_chord.chord_root;
            play_type = s->held_chord.chord_type;
        }

        /* At every quarter boundary that belongs to the chord sequencer, stop the previous
         * chord ONLY when a new chord is about to play — this gives legato sustain across
         * empty steps so chords ring until the next programmed step. */
        if (!chord_seq_has_steps && step == 0 && s->held_chord.active) {
            /* Legacy: held chord fires once per 2-bar loop */
            play_root = s->held_chord.chord_root;
            play_type = s->held_chord.chord_type;
        }

        if (play_root != 0xFF) {
            /* Stop previous bar chord notes now that a new one is starting */
            for (int i = 0; i < s->bar_chord_note_count; i++) {
                if (s->bar_chord_notes[i].active) {
                    if (!is_user_held(s->bar_chord_notes[i].note))
                        dexed_raw_handle_midi(0x80, s->bar_chord_notes[i].note, 0);
                    s->bar_chord_notes[i].active = false;
                }
            }
            s->bar_chord_note_count = 0;
            /* Update harmonic state so FIELD page + suggestion engine reflect the new chord */
            uint8_t abs_old = (s->harmonic.key + s->harmonic.chord_root) % 12;
            s->harmonic.prev_chord_root = abs_old;
            s->harmonic.prev_chord_type = s->harmonic.chord_type;
            s->harmonic.has_prev_chord  = true;
            s->harmonic.chord_root = (play_root - s->harmonic.key + 12) % 12;
            s->harmonic.chord_type = play_type;

            /* Keep held_chord in sync so the Circle display stays coherent */
            if (chord_seq_has_steps) {
                s->held_chord.chord_root = play_root;
                s->held_chord.chord_type = play_type;
                s->held_chord.active     = true;
            }

            /* Play new chord notes (legato — sustains until next chord trigger) */
            uint16_t mask = chord_masks[play_type];
            if (s->tight_voicing) {
                uint8_t tnotes[12]; int tcnt = 0;
                voice_tight_notes(mask, play_root,
                                  s->tight_prev_notes, s->tight_prev_count,
                                  tnotes, &tcnt);
                for (int i = 0; i < tcnt && s->bar_chord_note_count < 12; i++) {
                    uint8_t note = tnotes[i];
                    if (note <= 127) {
                        dexed_raw_handle_midi(0x90, note, 64);
                        s->bar_chord_notes[s->bar_chord_note_count].note   = note;
                        s->bar_chord_notes[s->bar_chord_note_count].active = true;
                        s->bar_chord_note_count++;
                    }
                }
            } else {
                uint8_t base_note = (uint8_t)((s->base_octave + 4) * 12 + play_root);
                for (int i = 0; i < 12 && s->bar_chord_note_count < 12; i++) {
                    if ((mask >> i) & 1) {
                        uint8_t note = base_note + i;
                        if (note <= 127) {
                            dexed_raw_handle_midi(0x90, note, 64);   /* 50% velocity */
                            s->bar_chord_notes[s->bar_chord_note_count].note   = note;
                            s->bar_chord_notes[s->bar_chord_note_count].active = true;
                            s->bar_chord_note_count++;
                        }
                    }
                }
            }
            /* Update tight voicing centroid */
            s->tight_prev_count = s->bar_chord_note_count;
            for (int i = 0; i < s->bar_chord_note_count; i++)
                s->tight_prev_notes[i] = s->bar_chord_notes[i].note;
        }
    }

    /* 4. Trigger notes at current step.
     * Playback is always active regardless of display mode — mode only controls
     * which page is shown on the Launchpad, not which tracks fire. */

    /* Fill intercept: play fill patterns instead of programmed tracks */
    if (s->fill_steps_remaining > 0) {
        int fi_step = step % FILL_PATTERN_LEN;
        for (int fi = 0; fi < FILL_NUM_TRACKS; fi++) {
            uint8_t vel = s->fill_is_outro
                        ? s_fill_patterns[fi].out_v[fi_step]
                        : s_fill_patterns[fi].in_v[fi_step];
            if (vel > 0)
                seq_drum_note_on(drum_midi_notes[s_fill_patterns[fi].idx], vel);
        }
        s->fill_steps_remaining--;
        if (s->fill_steps_remaining == 0) {
            if (s->fill_is_outro) {
                /* Stop all notes and signal main task to call step_seq_stop() */
                for (int i = 0; i < s->active_note_count; i++)
                    seq_note_off_routed(s->active_notes[i].channel,
                                        s->active_notes[i].note);
                s->active_note_count = 0;
                for (int i = 0; i < s->bar_chord_note_count; i++) {
                    if (s->bar_chord_notes[i].active) {
                        dexed_raw_handle_midi(0x80, s->bar_chord_notes[i].note, 0);
                        s->bar_chord_notes[i].active = false;
                    }
                }
                s->bar_chord_note_count = 0;
                /* Signal main task to call step_seq_stop() — do NOT set playing=false
                 * here; step_seq_stop() must do it so the timer gets cancelled. */
                s->fill_outro_done = true;
            }
            /* Intro fill done: normal playback resumes from next tick */
        }
        portEXIT_CRITICAL(&s->mux);
        return;
    }

    for (int d = 0; d < SEQ_NUM_DRUM_TRACKS; d++) {
        uint8_t vel = s->drum_tracks[d].steps[step].velocity;
        if (vel > 0) {
            seq_drum_note_on(drum_midi_notes[d], vel);
            /* Drum notes NOT tracked in active_notes[]: sample engine handles
             * its own decay; note-off on next tick would cut samples short. */
        }
    }
    {
        seq_melodic_step_t *ms = &s->melodic_steps[step];
        for (int n = 0; n < ms->note_count && s->active_note_count < SEQ_ACTIVE_NOTES_MAX; n++) {
            if (ms->notes[n] > 0) {
                dexed_raw_handle_midi(0x90, ms->notes[n], ms->velocities[n]);
                s->active_notes[s->active_note_count].note    = ms->notes[n];
                s->active_notes[s->active_note_count].channel = 0;
                s->active_note_count++;
            }
        }
    }

    /* Lookahead for FIELD display: switch the display chord SEQ_FIELD_LOOKAHEAD_MS
     * before it actually plays.  Comparison is in µs so the window is a fixed
     * wall-clock duration, fully independent of BPM. */
    s->display_harmonic = s->harmonic;
    if (s->playing && s->chord_seq_step >= 0) {
        uint64_t period_us          = step_period_us(s->bpm);
        int      steps_to_next      = 4 - (step % 4);          /* 1-4 steps until next quarter */
        uint64_t time_to_next_us    = (uint64_t)steps_to_next * period_us;
        if (time_to_next_us <= (uint64_t)SEQ_FIELD_LOOKAHEAD_MS * 1000ULL) {
            int next_q = (s->chord_seq_step + 1) % 32;
            if (s->chord_seq_steps[next_q].active) {
                s->display_harmonic.chord_root =
                    (s->chord_seq_steps[next_q].chord_root - s->harmonic.key + 12) % 12;
                s->display_harmonic.chord_type = s->chord_seq_steps[next_q].chord_type;
            }
        }
    }

