probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
/* ---- Suggestion engine ----
 * Computes how strongly a target chord should glow after playing a source chord.
 *
 * Uses circle-of-fifths distance + a diatonic transition bonus table.
 * Returns 0-5 (0 = no suggestion, 5 = very strong).
 */

/* Map an absolute semitone (0-11) to the nearest diatonic function index (0-6)
 * relative to the given key. Returns -1 if not diatonic. */
static int semitone_to_diatonic_index(uint8_t semitone, uint8_t key, scale_type_t scale)
{
    const uint8_t* degrees = get_scale_degrees(scale);
    int rel = ((int)semitone - (int)key + 12) % 12;
    for (int i = 0; i < 7; i++) {
        if (degrees[i] == rel) return i;
    }
    return -1;  /* not diatonic */
}

/*
 * Transition weight table for 7 diatonic chord functions (I=0 .. vii=6).
 * Higher value = more common / expected progression.
 * Rows = "from", Columns = "to".
 *
 *          I  ii iii  IV  V  vi vii
 * I       0   3   2   5  5   4   1
 * ii      2   0   1   2  5   1   2
 * iii     1   1   0   3  1   4   1
 * IV      4   2   1   0  5   2   1
 * V       5   1   2   2  0   3   1
 * vi      2   4   1   4  2   0   1
 * vii     5   1   2   1  2   1   0
 */
static const uint8_t diatonic_transition[7][7] = {
    {0, 3, 2, 5, 5, 4, 1},  /* from I   */
    {2, 0, 1, 2, 5, 1, 2},  /* from ii  */
    {1, 1, 0, 3, 1, 4, 1},  /* from iii */
    {4, 2, 1, 0, 5, 2, 1},  /* from IV  */
    {5, 1, 2, 2, 0, 3, 1},  /* from V   */
    {2, 4, 1, 4, 2, 0, 1},  /* from vi  */
    {5, 1, 2, 1, 2, 1, 0},  /* from vii */
};

/* Compute suggestion score for a target chord given the previous chord.
 * Returns 0-5. Uses diatonic lookup if both are diatonic, otherwise
 * falls back to circle-of-fifths distance. */
static uint8_t compute_suggestion(uint8_t from_root, uint8_t to_root,
                                  const harmonic_state_t* h)
{
    int from_idx = semitone_to_diatonic_index(from_root, h->key, h->scale_type);
    int to_idx   = semitone_to_diatonic_index(to_root, h->key, h->scale_type);

    if (from_idx >= 0 && to_idx >= 0) {
        return diatonic_transition[from_idx][to_idx];
    }

    /* Fallback: circle distance (1=close → high score, 6=far → low) */
    int dist = circle_distance(from_root, to_root);
    if (dist <= 1) return 4;
    if (dist <= 2) return 3;
    if (dist <= 3) return 2;
    return 1;
}

/* Score a note based on harmonic context (higher = more stable) */
static uint8_t score_note(uint8_t midi_note, const harmonic_state_t* h)
{
    uint8_t pc = midi_note % 12;
    uint8_t abs_chord_root = (h->key + h->chord_root) % 12;

    if (pc == abs_chord_root) {
        return 255;  /* Root - maximum stability */
    }
    if (is_chord_tone(pc, abs_chord_root, h->chord_type)) {
        return 200;  /* Other chord tone */
    }
    if (is_scale_tone(pc, h->key, h->scale_type)) {
        return 120;  /* Scale tone */
    }
    return 40;  /* Chromatic / tension */
}

/* Returns true if a MIDI note is "lit" (visible) in FIELD mode given current harmonic state.
 * Matches exactly the color logic in launchpad.cpp FIELD display. */
static bool is_note_lit(uint8_t midi_note, const harmonic_state_t* h)
{
    uint8_t pc            = midi_note % 12;
    uint8_t abs_chord_root = (h->key + h->chord_root) % 12;
    if (pc == abs_chord_root)                                           return true;
    if (is_chord_tone(pc, abs_chord_root, h->chord_type))               return true;
    if (h->tension >= 1 && is_scale_tone(pc, h->key, h->scale_type))   return true;
    if (h->tension >= 2)                                                return true;
    return false;
}

/* Quantize a MIDI note for FIELD mode: if the note is not lit, walk downward
 * (up to 12 semitones) until we find a lit note and return it. */
static uint8_t field_quantize(uint8_t midi_note)
{
    if (s_seq.mode != SEQ_MODE_FIELD) return midi_note;
    /* Walk down until we hit a lit pitch class */
    for (int delta = 0; delta <= 12; delta++) {
        int candidate = (int)midi_note - delta;
        if (candidate < 0) break;
        if (is_note_lit((uint8_t)candidate, &s_seq.display_harmonic)) return (uint8_t)candidate;
    }
    return midi_note;  /* fallback: nothing found, pass through */
}

/* Circle mode: 7 diatonic chord pads in a 3-col × 3-row grid.
 *
 *   col:       1     2      3
 *   row 3:     IV    I      V
 *   row 2:     ii    vi     iii
 *   row 1:           vii°
 *
 * (Example for C: F  C  G / Dm Am Em / Bdim)
 * Row 3 = bottom on the Launchpad (physical bottom = low row number).
 *
 * Degree index: 0=I  1=ii  2=iii  3=IV  4=V  5=vi  6=vii°
 * Returns the index (0-6), or -1 if the position is not a chord pad.
 */
static int circle_degree_at(uint8_t row, uint8_t col)
{
    if (row == 3 && col == 2) return 6;  /* vii° */
    if (row == 2 && col == 1) return 1;  /* ii   */
    if (row == 2 && col == 2) return 5;  /* vi   */
    if (row == 2 && col == 3) return 2;  /* iii  */
    if (row == 1 && col == 1) return 3;  /* IV   */
    if (row == 1 && col == 2) return 0;  /* I    */
    if (row == 1 && col == 3) return 4;  /* V    */
    return -1;
}

/* Semitone offsets from key root for each diatonic degree (major scale) */
static const uint8_t circle_degree_semitone[7] = { 0, 2, 4, 5, 7, 9, 11 };
static const chord_type_t circle_degree_type[7] = {
    CHORD_MAJ, CHORD_MIN, CHORD_MIN, CHORD_MAJ, CHORD_MAJ, CHORD_MIN, CHORD_DIM
};

/* Returns true and fills out_root/out_type when (row,col) is a valid chord pad. */
static bool get_circle_chord(uint8_t row, uint8_t col, uint8_t key,
                             uint8_t* out_root, chord_type_t* out_type)
{
    int deg = circle_degree_at(row, col);
    if (deg < 0) return false;
    *out_root = (key + circle_degree_semitone[deg]) % 12;
    *out_type = circle_degree_type[deg];
    return true;
}

/* Generate MIDI notes for a chord */
static void play_chord(uint8_t root, chord_type_t type, uint8_t velocity, uint8_t base_octave)
{
    uint16_t mask = chord_masks[type];
    uint8_t base_note = base_octave * 12 + root;

    for (int i = 0; i < 12; i++) {
        if ((mask >> i) & 1) {
            uint8_t note = base_note + i;
            if (note <= 127) {
                dexed_raw_handle_midi(0x90, note, velocity);
            }
        }
    }
}

/* Stop all chord notes */
static void stop_chord(uint8_t root, chord_type_t type, uint8_t base_octave)
{
    uint16_t mask = chord_masks[type];
    uint8_t base_note = base_octave * 12 + root;

    for (int i = 0; i < 12; i++) {
        if ((mask >> i) & 1) {
            uint8_t note = base_note + i;
            if (note <= 127 && !is_user_held(note)) {
                dexed_raw_handle_midi(0x80, note, 0);
            }
        }
    }
}

/* ---- Chromatic Field mode note mapping (2 rows per octave) ----
 *
 * Layout: 2 rows per octave, 8 columns for semitones.
 *   Odd rows (1,3,5,7):  semitones 0-7  (C, C♯, D, D♯, E, F, F♯, G)
 *   Even rows (2,4,6,8): semitones 4-11 (E, F, F♯, G, G♯, A, A♯, B)
 *
 * This overlaps semitones 4-7 across consecutive rows for visual continuity
 * while showing all 12 notes per octave.
 *
 * Row pairs: (1-2, 3-4, 5-6, 7-8) = octaves (base, base+1, base+2, base+3)
 */
static uint8_t get_field_note(uint8_t row, uint8_t col, const harmonic_state_t* h)
{
    uint8_t base_octave = s_seq.base_octave;
    int octave_index = (row - 1) / 2;  /* which pair of rows (0-3) */
    int octave = base_octave + octave_index;
    bool is_even_row = (row % 2 == 0);
    int base_semitone = is_even_row ? 6 : 0;  /* odd rows: 0-5 (C-F), even rows: 6-11 (F#-B) */
    int semitone_offset = base_semitone + (col - 1);
    
    int note = octave * 12 + h->key + semitone_offset;
    if (note < 0) note = 0;
    if (note > 127) note = 127;
    return (uint8_t)note;
}

/* ================================================
 * State queries for display
 * ================================================ */

int step_seq_get_current_step(void)
{
    return s_seq.current_step;
}

bool step_seq_drum_step_is_active(uint8_t drum, uint8_t step)
{
    if (drum >= SEQ_NUM_DRUM_TRACKS || step >= SEQ_MAX_STEPS) return false;
    return s_seq.drum_tracks[drum].steps[step].velocity > 0;
}

uint8_t step_seq_drum_step_velocity(uint8_t drum, uint8_t step)
{
    if (drum >= SEQ_NUM_DRUM_TRACKS || step >= SEQ_MAX_STEPS) return 0;
    return s_seq.drum_tracks[drum].steps[step].velocity;
}

/* ================================================
 * Grid coordinate helpers (local)
 * ================================================ */

