probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
/* Q1/Q2 pad → step index (Drum mode) */
static int grid_to_step_index(uint8_t row, uint8_t col)
{
    if (row < 5 || row > 8 || col < 1 || col > 8) return -1;
    return (8 - row) * 8 + (col - 1);
}

/* Q3 pad → drum index */
static int q3_to_drum_index(uint8_t row, uint8_t col)
{
    if (row < 1 || row > 4 || col < 1 || col > 4) return -1;
    return (row - 1) * 4 + (col - 1);
}

/* Q4 pad → velocity index */
static int q4_to_velocity_index(uint8_t row, uint8_t col)
{
    if (row < 1 || row > 4 || col < 5 || col > 8) return -1;
    return (row - 1) * 4 + (col - 5);
}

/* Velocity levels for Q4 */
static const uint8_t velocity_levels[16] = {
    8, 16, 24, 32, 40, 48, 56, 64,
    72, 80, 88, 96, 104, 112, 120, 127
};

/* ================================================
 * Input handlers (called from launchpad.cpp)
 * ================================================ */

void step_seq_handle_grid_press(uint8_t row, uint8_t col, uint8_t velocity)
{
    if (s_seq.mode == SEQ_MODE_DRUM || s_seq.mode == SEQ_MODE_BOTH) {
        if (lp_is_q1(row, col) || lp_is_q2(row, col)) {
            /* Step grid: toggle (or range-fill if another step is already held) */
            int step = grid_to_step_index(row, col);
            if (step >= 0 && step < s_seq.num_steps) {
                if (s_range_fill.active && s_range_fill.first_row < 0) {
                    /* Second pad: fill all steps between first and this */
                    int lo = (step < s_range_fill.first_step) ? step : s_range_fill.first_step;
                    int hi = (step > s_range_fill.first_step) ? step : s_range_fill.first_step;
                    for (int i = lo; i <= hi && i < s_seq.num_steps; i++) {
                        if (s_range_fill.fill_on) step_seq_drum_set_step((uint8_t)i, s_seq.current_velocity);
                        else                      step_seq_drum_clear_step((uint8_t)i);
                    }
                } else {
                    /* First pad: toggle and record for potential range fill */
                    bool was_active = step_seq_drum_step_is_active(s_seq.selected_drum, (uint8_t)step);
                    step_seq_drum_toggle_step((uint8_t)step);
                    s_range_fill.active     = true;
                    s_range_fill.first_step = step;
                    s_range_fill.first_row  = -1;
                    s_range_fill.fill_on    = !was_active;
                }
            }
        }
        else if (lp_is_q3(row, col)) {
            /* Drum pad selection + audition.
             * On pressure-sensitive pads (Launchpad X) adopt the actual played
             * velocity as the new current velocity so the next programmed step
             * uses it too.  A pad reporting exactly 64 is almost certainly a
             * fixed-velocity device — keep the existing velocity in that case. */
            int drum = q3_to_drum_index(row, col);
            if (drum >= 0 && drum < SEQ_NUM_DRUM_TRACKS) {
                step_seq_select_drum((uint8_t)drum);
                uint8_t v = (velocity > 0 && velocity != 64)
                            ? velocity
                            : s_seq.current_velocity;
                if (v != s_seq.current_velocity) step_seq_set_velocity(v);
                /* Audition: trigger the drum sound at played velocity */
                seq_drum_note_on(drum_midi_notes[drum], v);
            }
        }
        else if (lp_is_q4(row, col)) {
            /* Velocity selection grid — fixed preset levels per cell */
            int vel_idx = q4_to_velocity_index(row, col);
            if (vel_idx >= 0 && vel_idx < 16) {
                step_seq_set_velocity(velocity_levels[vel_idx]);
            }
        }
    }
    else if (s_seq.mode == SEQ_MODE_MELODIC) {
        if (lp_is_q1(row, col) || lp_is_q2(row, col)) {
            /* Melodic step grid: columns=time, rows=pitch */
            int step = (col - 1);  /* 0-7 */
            uint8_t pitch = (uint8_t)(s_seq.base_octave * 12 + (row - 5));
            if (s_range_fill.active && s_range_fill.first_row == (int)row) {
                /* Second pad in same row: fill column range with same on/off */
                int lo = (step < s_range_fill.first_step) ? step : s_range_fill.first_step;
                int hi = (step > s_range_fill.first_step) ? step : s_range_fill.first_step;
                for (int i = lo; i <= hi; i++) {
                    if (s_range_fill.fill_on) melodic_step_set_note((uint8_t)i, pitch, s_seq.current_velocity);
                    else                      melodic_step_clear_note((uint8_t)i, pitch);
                }
            } else {
                /* First pad: toggle and record */
                bool exists = melodic_step_has_note((uint8_t)step, pitch);
                step_seq_melodic_toggle_note((uint8_t)step, pitch, s_seq.current_velocity);
                s_range_fill.active     = true;
                s_range_fill.first_step = step;
                s_range_fill.first_row  = (int)row;
                s_range_fill.fill_on    = !exists;
            }
        }
        else if (lp_is_q3(row, col) || lp_is_q4(row, col)) {
            /* Keyboard: play note live */
            uint8_t base = s_seq.base_octave * 12;
            int offset;
            if (col <= 4) {
                offset = (row - 1) * 4 + (col - 1);
            } else {
                offset = 16 + (row - 1) * 4 + (col - 5);
            }
            uint8_t note = (uint8_t)(base + offset);
            if (note <= 127) {
                dexed_raw_handle_midi(0x90, note, velocity);
            }
        }
    }
    else if (s_seq.mode == SEQ_MODE_CIRCLE) {
        /* Circle mode: 7 diatonic pads (rows 1-3, specific cols only) */
        uint8_t chord_root; chord_type_t chord_type;
        if (lp_is_grid(row, col) && row <= 3 &&
            get_circle_chord(row, col, s_seq.harmonic.key, &chord_root, &chord_type)) {

            /* Stop any previously held notes — but never cut a user-held note */
            for (int i = 0; i < s_circle_lower_hold.note_count; i++)
                if (!is_user_held(s_circle_lower_hold.notes[i]))
                    dexed_raw_handle_midi(0x80, s_circle_lower_hold.notes[i], 0);
            s_circle_lower_hold.note_count = 0;
            /* Also clear bar-chord notes fired by the timer */
            portENTER_CRITICAL(&s_seq.mux);
            for (int i = 0; i < s_seq.bar_chord_note_count; i++) {
                if (s_seq.bar_chord_notes[i].active) {
                    if (!is_user_held(s_seq.bar_chord_notes[i].note))
                        dexed_raw_handle_midi(0x80, s_seq.bar_chord_notes[i].note, 0);
                    s_seq.bar_chord_notes[i].active = false;
                }
            }
            s_seq.bar_chord_note_count = 0;
            portEXIT_CRITICAL(&s_seq.mux);

