probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
            /* Save previous chord for suggestion engine */
            uint8_t abs_old = (s_seq.harmonic.key + s_seq.harmonic.chord_root) % 12;
            s_seq.harmonic.prev_chord_root = abs_old;
            s_seq.harmonic.prev_chord_type = s_seq.harmonic.chord_type;
            s_seq.harmonic.has_prev_chord = true;

            /* Update harmonic state to new chord */
            s_seq.harmonic.chord_root = (chord_root - s_seq.harmonic.key + 12) % 12;
            s_seq.harmonic.chord_type = chord_type;

            /* Sync display harmonic state so OLED shows the chord immediately */
            s_seq.display_harmonic = s_seq.harmonic;

            /* Track last manually-selected chord for step assignment */
            s_seq.selected_chord_root = chord_root;
            s_seq.selected_chord_type = chord_type;
            s_seq.has_selected_chord  = true;

            /* Play and record exact notes — stopped precisely on pad release.
             * Suppress note-on during an intro drum fill; the chord is already
             * stored in harmonic state and will fire on the next quarter-note. */
            bool intro_running = s_seq.playing
                                 && s_seq.fill_steps_remaining > 0
                                 && !s_seq.fill_is_outro;
            if (!intro_running) {
                uint16_t mask = chord_masks[chord_type];
                if (s_seq.tight_voicing) {
                    uint8_t tnotes[12]; int tcnt = 0;
                    voice_tight_notes(mask, chord_root,
                                      s_seq.tight_prev_notes, s_seq.tight_prev_count,
                                      tnotes, &tcnt);
                    for (int i = 0; i < tcnt; i++) {
                        uint8_t n = tnotes[i];
                        if (n <= 127 && s_circle_lower_hold.note_count < 12) {
                            dexed_raw_handle_midi(0x90, n, velocity);
                            s_circle_lower_hold.notes[s_circle_lower_hold.note_count++] = n;
                        }
                    }
                } else {
                    uint8_t base_note = (uint8_t)((s_seq.base_octave + 4) * 12 + chord_root);
                    for (int i = 0; i < 12; i++) {
                        if ((mask >> i) & 1) {
                            uint8_t n = base_note + i;
                            if (n <= 127 && s_circle_lower_hold.note_count < 12) {
                                dexed_raw_handle_midi(0x90, n, velocity);
                                s_circle_lower_hold.notes[s_circle_lower_hold.note_count++] = n;
                            }
                        }
                    }
                }
                /* Update tight voicing centroid */
                s_seq.tight_prev_count = s_circle_lower_hold.note_count;
                for (int i = 0; i < s_circle_lower_hold.note_count; i++)
                    s_seq.tight_prev_notes[i] = s_circle_lower_hold.notes[i];
            }

            ESP_LOGI(TAG, "Circle: %s%s (hold-while-pressed) (prev %s)",
                     note_names[chord_root], chord_type_names[chord_type],
                     s_seq.harmonic.has_prev_chord ? note_names[abs_old] : "none");

            /* Update OLED display with new chord name */
            esp32_oled_update_chord();
        }
        else if (lp_is_grid(row, col) && row >= 5) {
            /* Chord step sequencer: rows 5-8, cols 1-8 → steps 0-31
             * same layout as drum grid: row 8 = steps 0-7, row 7 = 8-15,
             * row 6 = 16-23, row 5 = 24-31 */
            int seq_step = (8 - row) * 8 + (col - 1);  /* 0-31 */
            if (seq_step >= 0 && seq_step < 32 && s_seq.has_selected_chord) {
                if (s_range_fill.active && s_range_fill.first_row < 0) {
                    /* Second pad: fill all chord-seq steps between first and this */
                    int lo = (seq_step < s_range_fill.first_step) ? seq_step : s_range_fill.first_step;
                    int hi = (seq_step > s_range_fill.first_step) ? seq_step : s_range_fill.first_step;
                    portENTER_CRITICAL(&s_seq.mux);
                    for (int i = lo; i <= hi && i < 32; i++) {
                        if (s_range_fill.fill_on) {
                            s_seq.chord_seq_steps[i].chord_root = s_seq.selected_chord_root;
                            s_seq.chord_seq_steps[i].chord_type = s_seq.selected_chord_type;
                            s_seq.chord_seq_steps[i].active = true;
                        } else {
                            s_seq.chord_seq_steps[i].active = false;
                        }
                    }
                    portEXIT_CRITICAL(&s_seq.mux);
                    ESP_LOGI(TAG, "ChordSeq range fill %s steps %d-%d",
                             s_range_fill.fill_on ? "ON" : "OFF", lo, hi);
                } else {
                    /* First pad: toggle and record */
                    bool was_active = false;
                    portENTER_CRITICAL(&s_seq.mux);
                    if (s_seq.chord_seq_steps[seq_step].active &&
                        s_seq.chord_seq_steps[seq_step].chord_root == s_seq.selected_chord_root &&
                        s_seq.chord_seq_steps[seq_step].chord_type == s_seq.selected_chord_type) {
                        s_seq.chord_seq_steps[seq_step].active = false;
                        was_active = true;
                    } else {
                        s_seq.chord_seq_steps[seq_step].chord_root = s_seq.selected_chord_root;
                        s_seq.chord_seq_steps[seq_step].chord_type = s_seq.selected_chord_type;
                        s_seq.chord_seq_steps[seq_step].active = true;
                    }
                    portEXIT_CRITICAL(&s_seq.mux);
                    s_range_fill.active     = true;
                    s_range_fill.first_step = seq_step;
                    s_range_fill.first_row  = -1;
                    s_range_fill.fill_on    = !was_active;
                    if (was_active) {
                        ESP_LOGI(TAG, "ChordSeq step %d cleared", seq_step);
                    } else {
                        char _roman[8] = {0};
                        step_seq_chord_roman_numeral(s_seq.selected_chord_root,
                            s_seq.selected_chord_type, s_seq.harmonic.scale_type,
                            _roman, sizeof(_roman));
                        ESP_LOGI(TAG, "ChordSeq step %d: %s (%s%s)", seq_step,
                                 _roman, note_names[s_seq.selected_chord_root],
                                 chord_type_names[s_seq.selected_chord_type]);
                    }
                }
            }
            /* No sound on sequencer grid pads — step-toggle only */
        }
    }
    else if (s_seq.mode == SEQ_MODE_FIELD) {
        /* Melodic field mode - all rows 1-8, cols 1-6 only (cols 7-8 disabled) */
        if (lp_is_grid(row, col) && col <= 6) {
            uint8_t note = get_field_note(row, col, &s_seq.harmonic);
            /* Quantize: if this pad is off (not lit), redirect to nearest lower lit note */
            note = field_quantize(note);

            /* Track the (possibly redirected) note for release */
            int pad_idx = (row - 1) * 8 + (col - 1);
            if (pad_idx >= 0 && pad_idx < 64) {
                s_seq.field_notes[pad_idx].note = note;
                s_seq.field_notes[pad_idx].active = true;
            }
            
            /* Scale velocity by harmonic role:
             *   chord tone (root/other) → full pad velocity
             *   scale tone (yellow)     → 66 %
             *   tension tone (orange)   → 33 % */
            uint8_t score = score_note(note, &s_seq.display_harmonic);
            uint8_t play_vel;
            if (score >= 200) {
                play_vel = velocity;               /* chord tone → full */
            } else if (score >= 120) {
                play_vel = (uint8_t)((velocity * 2 + 2) / 3);   /* ~66 % */
            } else {
                play_vel = (uint8_t)((velocity + 2) / 3);        /* ~33 % */
            }
            if (play_vel < 1) play_vel = 1;

            dexed_raw_handle_midi(0x90, note, play_vel);
            ESP_LOGD(TAG, "Field: note=%d (%s) score=%d vel=%d",
                     note, note_names[note % 12], score, play_vel);
        }
    }

    /* Refresh display */
    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

void step_seq_handle_grid_release(uint8_t row, uint8_t col)
{
    /* Send Note Off for auditioned sounds */
    if (s_seq.mode == SEQ_MODE_DRUM || s_seq.mode == SEQ_MODE_BOTH) {
        if (lp_is_q3(row, col)) {
            int drum = q3_to_drum_index(row, col);
            if (drum >= 0 && drum < SEQ_NUM_DRUM_TRACKS) {
                seq_drum_note_off(drum_midi_notes[drum]);
            }
        }
        else if (lp_is_q1(row, col) || lp_is_q2(row, col)) {
            s_range_fill.active = false;  /* end range-fill gesture */
        }
    }
    else if (s_seq.mode == SEQ_MODE_MELODIC) {
        if (lp_is_q1(row, col) || lp_is_q2(row, col)) {
            s_range_fill.active = false;  /* end range-fill gesture */
        }
        else if (lp_is_q3(row, col) || lp_is_q4(row, col)) {
            uint8_t base = s_seq.base_octave * 12;
            int offset;
            if (col <= 4) {
                offset = (row - 1) * 4 + (col - 1);
            } else {
                offset = 16 + (row - 1) * 4 + (col - 5);
            }
            uint8_t note = (uint8_t)(base + offset);
            if (note <= 127) {
                dexed_raw_handle_midi(0x80, note, 0);
            }
        }
    }
    else if (s_seq.mode == SEQ_MODE_CIRCLE) {
        /* Rows 1-3 are hold-while-pressed — stop recorded notes on release */
        if (row <= 3 && s_circle_lower_hold.note_count > 0) {
            for (int i = 0; i < s_circle_lower_hold.note_count; i++)
                dexed_raw_handle_midi(0x80, s_circle_lower_hold.notes[i], 0);
            s_circle_lower_hold.note_count = 0;
        }
        else if (row >= 5) {
            s_range_fill.active = false;  /* end range-fill gesture for chord seq */
        }
        /* Refresh so the white "active" highlight clears on release */
        if (launchpad_is_connected()) {
            launchpad_refresh_grid();
        }
    }
    else if (s_seq.mode == SEQ_MODE_FIELD) {
        /* Release note when pad released (cols 7-8 are inactive, no-op) */
        if (lp_is_grid(row, col) && col <= 6) {
            int pad_idx = (row - 1) * 8 + (col - 1);
            if (pad_idx >= 0 && pad_idx < 64 && s_seq.field_notes[pad_idx].active) {
                uint8_t note = s_seq.field_notes[pad_idx].note;
                dexed_raw_handle_midi(0x80, note, 0);
                s_seq.field_notes[pad_idx].active = false;
            }
        }
    }
}

