probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
void step_seq_handle_button(uint8_t cc, uint8_t value)
{
    switch (cc) {
        case LP_CC_SESSION:
            if (value > 0) {
                /* Record press time for long-press detection */
                s_session_press_us = esp_timer_get_time();
            } else {
                /* Button released — decide short vs long press */
                if (s_session_press_us == 0) break;  /* spurious release */
                int64_t elapsed = esp_timer_get_time() - s_session_press_us;
                s_session_press_us = 0;
                if (!s_seq.playing) {
                    /* ---- START ---- */
                    if (elapsed >= SESSION_LONG_PRESS_US) {
                        /* Long press: intro fill, mark as fill-start run */
                        portENTER_CRITICAL(&s_seq.mux);
                        s_seq.fill_is_outro        = false;
                        s_seq.fill_outro_done      = false;
                        s_seq.fill_outro_pending   = false;
                        s_seq.fill_steps_remaining = s_seq.num_steps;
                        portEXIT_CRITICAL(&s_seq.mux);
                        step_seq_play();
                        portENTER_CRITICAL(&s_seq.mux);
                        s_seq.started_with_fill = true;
                        portEXIT_CRITICAL(&s_seq.mux);
                        ESP_LOGI(TAG, "Intro fill started");
                        esp32_oled_show_status("FILL", "INTRO");
                    } else {
                        /* Short press: immediate start, no fill */
                        step_seq_play();
                    }
                } else {
                    /* ---- STOP ---- */
                    if (s_seq.started_with_fill || elapsed >= SESSION_LONG_PRESS_US) {
                        /* Outro fill — schedule for next bar boundary */
                        portENTER_CRITICAL(&s_seq.mux);
                        s_seq.fill_outro_pending = true;
                        portEXIT_CRITICAL(&s_seq.mux);
                        ESP_LOGI(TAG, "Outro fill pending (next bar)");
                        esp32_oled_show_status("FILL", "OUTRO");
                    } else {
                        /* Short press on a non-fill-start run: immediate stop */
                        step_seq_stop();
                    }
                }
            }
            break;

        case LP_CC_DRUMS:
            if (value > 0) {
                /* Press DRUMS button */
                if (s_seq.keys_btn_held) {
                    /* KEYS is already held → enter/toggle BOTH */
                    if (s_seq.mode == SEQ_MODE_BOTH) {
                        /* Already in BOTH, exit to MELODIC (KEYS is held) */
                        step_seq_set_mode(SEQ_MODE_MELODIC);
                    } else {
                        /* Enter BOTH */
                        step_seq_set_mode(SEQ_MODE_BOTH);
                    }
                } else if (s_seq.mode == SEQ_MODE_DRUM || s_seq.mode == SEQ_MODE_BOTH) {
                    /* Already in drum mode → cycle through drum presets */
                    int npresets = tsf_engine_get_preset_count();
                    if (npresets > 1) {
                        int next = (tsf_engine_get_current_preset() + 1) % npresets;
                        tsf_engine_select_preset(next);
                        char pname[24] = {0};
                        tsf_engine_copy_preset_name(next, pname, sizeof(pname));
                        esp32_oled_show_status("DRUM KIT", pname[0] ? pname : "?");
                        ESP_LOGI(TAG, "Drum preset: %d '%s'", next, pname[0] ? pname : "?");
                    }
                } else {
                    /* KEYS not held → enter DRUM only */
                    step_seq_set_mode(SEQ_MODE_DRUM);
                }
            }
            s_seq.drums_btn_held = (value > 0);
            break;

        case LP_CC_KEYS:
            if (value > 0) {
                /* Press KEYS button */
                if (s_seq.drums_btn_held) {
                    /* DRUMS is already held → enter/toggle BOTH */
                    if (s_seq.mode == SEQ_MODE_BOTH) {
                        /* Already in BOTH, exit to DRUM (DRUMS is held) */
                        step_seq_set_mode(SEQ_MODE_DRUM);
                    } else {
                        /* Enter BOTH */
                        step_seq_set_mode(SEQ_MODE_BOTH);
                    }
                } else {
                    /* DRUMS not held → enter MELODIC only */
                    step_seq_set_mode(SEQ_MODE_MELODIC);
                }
            }
            s_seq.keys_btn_held = (value > 0);
            break;

        case LP_CC_UP:
            if (value > 0) step_seq_adjust_bpm(+5);
            break;

        case LP_CC_DOWN:
            if (value > 0) step_seq_adjust_bpm(-5);
            break;

        case LP_CC_LEFT:
            if (value > 0) step_seq_page_left();
            break;

        case LP_CC_RIGHT:
            if (value > 0) step_seq_page_right();
            break;

        /* ---- Right column buttons: mode selection ---- */
        case LP_CC_MODE_SEQ:
            if (value > 0) {
                /* Stop any held chord when switching away from Circle mode */
                if (s_seq.held_chord.active) {
                    stop_chord(s_seq.held_chord.chord_root, s_seq.held_chord.chord_type,
                               s_seq.base_octave + 3);
                    s_seq.held_chord.active = false;
                }
                /* Return to step sequencer (Drum mode default) */
                step_seq_set_mode(SEQ_MODE_DRUM);
                ESP_LOGI(TAG, "Mode: Step Sequencer");
            }
            break;

        case LP_CC_MODE_CIRCLE:
            if (value > 0) {
                if (s_seq.mode == SEQ_MODE_CIRCLE) {
                    /* Already in Circle mode → toggle tight voicing */
                    s_seq.tight_voicing = !s_seq.tight_voicing;
                    esp32_oled_show_status("VOICING",
                                          s_seq.tight_voicing ? "TIGHT" : "FREE");
                    ESP_LOGI(TAG, "Tight voicing: %s",
                             s_seq.tight_voicing ? "ON" : "OFF");
                } else {
                    /* Initialize held chord tracking when entering Circle mode */
                    s_seq.held_chord.active = false;
                    step_seq_set_mode(SEQ_MODE_CIRCLE);
                    ESP_LOGI(TAG, "Mode: Circle of Fifths");
                }
            }
            break;

        case LP_CC_MODE_FIELD:
            if (value > 0) {
                /* Do NOT stop the held chord when switching to Field mode.
                 * This allows melody to play "over" the harmony.
                 * The chord sustains until explicitly toggled off or changed.
                 */
                step_seq_set_mode(SEQ_MODE_FIELD);
                ESP_LOGI(TAG, "Mode: Melodic Field (chord sustains)");
            }
            break;

        case LP_CC_KEY_SELECT:
            if (value > 0) {
                /* Cycle through keys: C, C#, D, ... B */
                uint8_t new_key = (s_seq.harmonic.key + 1) % 12;
                step_seq_set_key(new_key);
                ESP_LOGI(TAG, "Key: %s", note_names[new_key]);
            }
            break;

