probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
        case LP_CC_SCALE_SELECT:
            if (value > 0) {
                /* Cycle through scale types */
                scale_type_t new_scale = (scale_type_t)((s_seq.harmonic.scale_type + 1) % SCALE_TYPE_COUNT);
                step_seq_set_scale(new_scale);
            }
            break;

        case LP_CC_TENSION:
            if (value > 0) {
                /* Cycle tension 0-3 */
                uint8_t new_tension = (s_seq.harmonic.tension + 1) % 4;
                step_seq_set_tension(new_tension);
            }
            break;

        case LP_CC_CLEAR:
            if (value > 0) {
                /* Stop any held chord first */
                if (s_seq.held_chord.active) {
                    stop_chord(s_seq.held_chord.chord_root, s_seq.held_chord.chord_type,
                               s_seq.base_octave + 3);
                    s_seq.held_chord.active = false;
                }
                /* Turn off bar chord notes */
                portENTER_CRITICAL(&s_seq.mux);
                for (int i = 0; i < s_seq.bar_chord_note_count; i++) {
                    if (s_seq.bar_chord_notes[i].active) {
                        dexed_raw_handle_midi(0x80, s_seq.bar_chord_notes[i].note, 0);
                        s_seq.bar_chord_notes[i].active = false;
                    }
                }
                s_seq.bar_chord_note_count = 0;
                portEXIT_CRITICAL(&s_seq.mux);
                
                /* Reset harmonic state to defaults */
                s_seq.harmonic.key = 0;
                s_seq.harmonic.chord_root = 0;
                s_seq.harmonic.chord_type = CHORD_MAJ;
                s_seq.harmonic.scale_type = SCALE_MAJOR;
                s_seq.harmonic.tension = 0;
                s_seq.harmonic.prev_chord_root = 0;
                s_seq.harmonic.prev_chord_type = CHORD_MAJ;
                s_seq.harmonic.has_prev_chord = false;
                ESP_LOGI(TAG, "Harmonic state reset");
            }
            break;

        default:
            break;
    }

    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

/* ================================================
 * Public API wrappers for display / launchpad use
 * ================================================ */

uint8_t step_seq_get_suggestion_score(uint8_t to_root)
{
    if (!s_seq.harmonic.has_prev_chord) {
        /* No previous chord — fall back to relationship to key */
        int dist = circle_distance(to_root, s_seq.harmonic.key);
        if (dist == 0) return 5;
        if (dist <= 1) return 4;
        if (dist <= 2) return 3;
        return 1;
    }
    return compute_suggestion(s_seq.harmonic.prev_chord_root, to_root, &s_seq.harmonic);
}

uint8_t step_seq_field_quantize_note(uint8_t midi_note)
{
    return field_quantize(midi_note);
}

/* Record that `raw` was remapped to `quantized` on note-on.
 * Must be called after every quantized note-on so note-off can find it. */
void step_seq_field_record_noteon(uint8_t raw, uint8_t quantized)
{
    if (raw < 128) s_field_note_map[raw] = quantized ? quantized : raw;
}

/* Return the note to use for note-off corresponding to a raw incoming note,
 * then clear the mapping.  Falls back to `raw` if no mapping was stored.
 * This ensures note-offs are never affected by harmonic changes. */
uint8_t step_seq_field_resolve_noteoff(uint8_t raw)
{
    if (raw >= 128) return raw;
    uint8_t mapped = s_field_note_map[raw];
    s_field_note_map[raw] = 0;
    return mapped ? mapped : raw;
}

const harmonic_state_t* step_seq_get_display_harmonic_state(void)
{
    return &s_seq.display_harmonic;
}

/* Scale velocity by harmonic role when in FIELD mode.
 * Chord tone → full, scale tone (yellow) → ~66 %, tension (orange) → ~33 %.
 * Pass-through unchanged in all other modes. */
uint8_t step_seq_melodic_scale_velocity(uint8_t midi_note, uint8_t velocity)
{
    if (s_seq.mode != SEQ_MODE_FIELD) return velocity;
    uint8_t sc = score_note(midi_note, &s_seq.display_harmonic);
    if (sc >= 200) return velocity;                          /* chord tone */
    if (sc >= 120) return (uint8_t)((velocity * 2 + 2) / 3); /* scale tone ~66 % */
    uint8_t v = (uint8_t)((velocity + 2) / 3);               /* tension ~33 % */
    return v < 1 ? 1 : v;
}

uint8_t step_seq_get_field_note(uint8_t row, uint8_t col)
{
    return get_field_note(row, col, &s_seq.harmonic);
}

/* ================================================
 * Roman numeral helper
 * ================================================ */

/* Per-scale degree offsets from key root (semitones); 0xFF = sentinel */
static const uint8_t s_degree_offsets[SCALE_TYPE_COUNT][8] = {
    {0,2,4,5,7,9,11,0xFF},       /* MAJOR       */
    {0,2,3,5,7,8,10,0xFF},       /* MINOR       */
    {0,2,3,5,7,9,10,0xFF},       /* DORIAN      */
    {0,2,4,5,7,9,10,0xFF},       /* MIXOLYDIAN  */
    {0,1,3,5,7,8,10,0xFF},       /* PHRYGIAN    */
    {0,2,4,6,7,9,11,0xFF},       /* LYDIAN      */
    {0,1,3,5,6,8,10,0xFF},       /* LOCRIAN     */
    {0,2,4,7,9,0xFF,0xFF,0xFF},  /* PENTA_MAJ   */
    {0,3,5,7,10,0xFF,0xFF,0xFF}, /* PENTA_MIN   */
};

static const char * const s_roman_up[7]  = {"I","II","III","IV","V","VI","VII"};
static const char * const s_roman_lo[7]  = {"i","ii","iii","iv","v","vi","vii"};

static bool chord_is_major_quality(chord_type_t t)
{
    return t == CHORD_MAJ || t == CHORD_DOM7 || t == CHORD_AUG
        || t == CHORD_SUS4 || t == CHORD_SUS2;
}

void step_seq_chord_roman_numeral(uint8_t chord_root_rel, chord_type_t type,
                                  scale_type_t scale, char *out, int len)
{
    if (!out || len < 2) return;
    const uint8_t *deg = s_degree_offsets[scale < SCALE_TYPE_COUNT ? (int)scale : 0];
    bool maj = chord_is_major_quality(type);

    /* Exact match */
    for (int i = 0; i < 7 && deg[i] != 0xFF; i++) {
        if (deg[i] == chord_root_rel) {
            snprintf(out, (size_t)len, "%s", maj ? s_roman_up[i] : s_roman_lo[i]);
            return;
        }
    }
    /* Chromatic note — prefix nearest diatonic degree with b or # */
    int best = 0, best_dist = 12;
    for (int i = 0; i < 7 && deg[i] != 0xFF; i++) {
        int d = abs((int)deg[i] - (int)chord_root_rel);
        if (d > 6) d = 12 - d;
        if (d < best_dist) { best_dist = d; best = i; }
    }
    /* flat if chord_root is one semitone below that degree */
    int diff = (int)chord_root_rel - (int)deg[best];
    if (diff < -6) diff += 12;
    if (diff >  6) diff -= 12;
    const char *pfx = (diff < 0) ? "b" : "#";
    snprintf(out, (size_t)len, "%s%s", pfx,
             maj ? s_roman_up[best] : s_roman_lo[best]);
}

bool step_seq_is_chord_tone(uint8_t pitch_class, uint8_t chord_root, chord_type_t type)
{
    return is_chord_tone(pitch_class, chord_root, type);
}

bool step_seq_is_scale_tone(uint8_t pitch_class, uint8_t key, scale_type_t scale)
{
    return is_scale_tone(pitch_class, key, scale);
}

bool step_seq_get_circle_chord(uint8_t row, uint8_t col, uint8_t* out_root, chord_type_t* out_type)
{
    return get_circle_chord(row, col, s_seq.harmonic.key, out_root, out_type);
}

int step_seq_get_circle_degree(uint8_t row, uint8_t col)
{
    return circle_degree_at(row, col);
}
/* ================================================
 * Chord step sequencer query API
 * ================================================ */

bool step_seq_chord_seq_step_active(uint8_t step)
{
    if (step >= 32) return false;
    return s_seq.chord_seq_steps[step].active;
}

uint8_t step_seq_chord_seq_step_root(uint8_t step)
{
    if (step >= 32) return 0;
    return s_seq.chord_seq_steps[step].chord_root;
}

chord_type_t step_seq_chord_seq_step_type(uint8_t step)
{
    if (step >= 32) return CHORD_MAJ;
    return s_seq.chord_seq_steps[step].chord_type;
}

int step_seq_chord_seq_current(void)
{
    return s_seq.chord_seq_step;
}
